Revit 2026 API

# RebarShapeParameters Class

---

Class containing functions that create and retrieve shared parameters for RebarShapes.

SystemObject Autodesk.Revit.DB.StructureRebarShapeParameters

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarShapeParameters : IDisposable
```
```vb
Public Class RebarShapeParameters
	Implements IDisposable
```
```cpp
public ref class RebarShapeParameters : IDisposable
```
```fsharp
type RebarShapeParameters =
    class
        interface IDisposable
    end
```

The RebarShapeParameters type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarShapeParameters |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAllRebarShapeParameters | List all shape parameters used by all the existing RebarShapes in the specified document. |
|  | GetElementIdForExternalDefinition | Retrieve the ElementId corresponding to an external rebar shape parameter in the document, if it exists; otherwise, return InvalidElementId. |
|  | GetExternalDefinitionForElementId | Seach a DefinitionFile for the ExternalDefinition corresponding to a parameter in a document. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetOrCreateElementIdForExternalDefinition | Retrieve the ElementId corresponding to an external rebar shape parameter in the document, if it exists; otherwise, add the parameter to the document and generate a new ElementId. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidExternalDefinition | Checks that an ExternalDefinition (shared parameter) may be used as a Rebar Shape parameter. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace